DataProcessors/ДублиНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ДублиНСИ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДублиНСИКПодтверждению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИКПодтверждению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПоискаДублейНСИ</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДублей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ДублиНСИ/Forms/СравнениеИПодтверждениеДублей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторДублей = Параметры.ИдентификаторОбъектаМетаданных;
	Если ИдентификаторДублей.Пустая() Тогда
		ТипСсылки = Параметры.ТипСсылки;
		ИдентификаторДублей = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипСсылки);
	КонецЕсли;
	
	ИдентификаторыГрупп = РегистрыСведений.ДублиНСИКПодтверждению.СвязанныеГруппы(Параметры.ИдентификаторГруппы);
	
	ПриСозданииЧтенииНаСервере(ИдентификаторДублей, ИдентификаторыГрупп);
	
	Элементы.СвернутьПанель.Видимость = Ложь;
	Элементы.ГруппаДубли.Видимость = Ложь;
	Элементы.РазвернутьПанель.Видимость = Истина;
	
	Для Каждого СтрокаТаблицы Из Дубли Цикл
		СтрокаТаблицы.Пометка = Истина;
	КонецЦикла;
	
	ВариантСравненияДублей = "ТолькоОтличия";
	
	ЕстьДоступКПравилам = ПравоДоступа("Редактирование", Метаданные.Справочники.ПравилаПоискаДублейНСИ);
	ЕстьДоступКПользователям = ПравоДоступа("Просмотр", Метаданные.Справочники.Пользователи);
	ЕстьПолныеПрава = Пользователи.ЭтоПолноправныйПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьОтчетОСравнении();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КСравнениюДобавленыСвязанныеДублиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДеревоИсточникиИДубли = Новый Соответствие;
	Для Каждого СтрокаДублей Из ДублиСПовторамиВГруппах Цикл
		Если ДеревоИсточникиИДубли[СтрокаДублей.ГруппаДублей] = Неопределено Тогда
			ДеревоИсточникиИДубли.Вставить(СтрокаДублей.ГруппаДублей, Новый Массив);
		КонецЕсли;
		
		ИнформацияОДубле = Новый Структура;
		ИнформацияОДубле.Вставить("Код", СтрокаДублей.Код);
		ИнформацияОДубле.Вставить("Дубль", СтрокаДублей.Дубль);
		ИнформацияОДубле.Вставить("Источник", СтрокаДублей.Источник);
		ИнформацияОДубле.Вставить("ИндексКартинки", СтрокаДублей.ИндексКартинки);
		ДеревоИсточникиИДубли[СтрокаДублей.ГруппаДублей].Добавить(ИнформацияОДубле);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура("ИсточникиИДубли", ДеревоИсточникиИДубли);
	ОткрытьФорму("Обработка.ДублиНСИ.Форма.СвязанныеГруппыДублей", ПараметрыОткрытия, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОСравненииОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Расшифровка.Свойство("РасшифровкаСтатуса") Тогда
			
			Статусы = Новый СписокЗначений;
			Статусы.Добавить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльЗаменить());
			Статусы.Добавить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльНеУдалять());
			Статусы.Добавить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусОригинал());
			Статусы.Добавить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусНеЯвляетсяДублем());
			Статусы.Добавить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусТребуетсяПодтверждение());
			
			ОповещениеОбОкончанииВыбора = Новый ОписаниеОповещения("ПослеВыбораСтатусаВОтчете", ЭтотОбъект, Расшифровка);
			ПоказатьВыборИзМеню(ОповещениеОбОкончанииВыбора, Статусы);
			
		ИначеЕсли Расшифровка.Свойство("РасшифровкаМестИспользования") Тогда
			
			ПоискИУдалениеДублейКлиент.ПоказатьМестаИспользования(Расшифровка.Дубль);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСравненияДублейПриИзменении(Элемент)
	ПриИзмененииНастроекОтчета();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДубли

&НаКлиенте
Процедура ДублиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Дубли.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ДублиМестИспользования" Тогда
		СтандартнаяОбработка = Ложь;
		ПоискИУдалениеДублейКлиент.ПоказатьМестаИспользования(ТекущиеДанные.Дубль);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДублиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Дубли.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Источник = ТекущиеДанные.Источник;
	Если ЗначениеЗаполнено(Источник) Тогда
		
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ПравилаПоискаДублейНСИ") Тогда
			Если ЕстьДоступКПравилам Или ЕстьПолныеПрава Тогда
				ДубльНайденПоПравилу = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
					НСтр("ru = 'Дубль найден по правилу <a href=""%1"">%2</a>'"),
					ПолучитьНавигационнуюСсылку(Источник),
					Строка(Источник));
			Иначе
				ДубльНайденПоПравилу = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
					НСтр("ru = 'Дубль найден по правилу ""%1""'"), 
					Строка(Источник));
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Пользователи") Тогда
			Если ЕстьДоступКПользователям Или ЕстьПолныеПрава Тогда
				ДубльНайденПоПравилу = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
					НСтр("ru = 'Дубль зарегистрирован пользователем <a href=""%1"">%2</a>'"), 
					ПолучитьНавигационнуюСсылку(Источник),
					Строка(Источник));
			Иначе
				ДубльНайденПоПравилу = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
					НСтр("ru = 'Дубль зарегистрирован пользователем ""%1""'"), 
					Строка(Источник));
			КонецЕсли;
			
		Иначе
			Если ЕстьПолныеПрава Тогда
				ДубльНайденПоПравилу = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
					НСтр("ru = 'Дубль зарегистрирован <a href=""%1"">%2</a>'"),
					ПолучитьНавигационнуюСсылку(Источник),
					Строка(Источник));
			Иначе
				ДубльНайденПоПравилу = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
					НСтр("ru = 'Дубль зарегистрирован ""%1""'"),
					Строка(Источник));
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		ДубльНайденПоПравилу = СтроковыеФункцииКлиент.ФорматированнаяСтрока(НСтр("ru = 'Дубль подтвержден'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьВсе(Команда)
	УстановитьЗначениеПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьЗначениеПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПанель(Команда)
	
	Элементы.РазвернутьПанель.Видимость = Ложь;
	Элементы.ГруппаДубли.Видимость = Истина;
	Элементы.СвернутьПанель.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПанель(Команда)
	
	Элементы.СвернутьПанель.Видимость = Ложь;
	Элементы.ГруппаДубли.Видимость = Ложь;
	Элементы.РазвернутьПанель.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусДубльЗаменить(Команда)
	УстановитьСтатусДляВыделенных(ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльЗаменить());
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусДубльНеУдалять(Команда)
	УстановитьСтатусДляВыделенных(ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльНеУдалять());
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОригинал(Команда)
	УстановитьСтатусДляВыделенных(ПоискИЗаменаДублейНСИКлиентСервер.СтатусОригинал());
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНеЯвляетсяДублем(Команда)
	УстановитьСтатусДляВыделенных(ПоискИЗаменаДублейНСИКлиентСервер.СтатусНеЯвляетсяДублем());
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусТребуетсяПодтверждение(Команда)
	УстановитьСтатусДляВыделенных(ПоискИЗаменаДублейНСИКлиентСервер.СтатусТребуетсяПодтверждение());
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСсылку(Команда)
	
	ТекущиеДанные = Элементы.Дубли.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Дубль);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьДубли(Команда)
	
	РезультатПодтверждения = РезультатПодтвержденияДублей();
	
	Если ЗначениеЗаполнено(РезультатПодтверждения.ТекстПредупрежденияОНесоответствии) Тогда
		
		ПоказатьПредупреждение(, РезультатПодтверждения.ТекстПредупрежденияОНесоответствии);
		Возврат;
		
	ИначеЕсли ЗначениеЗаполнено(РезультатПодтверждения.ТекстПредупрежденияОПовторномПоиске) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияЗаменыДублей", ЭтотОбъект);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Продолжить", НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить("Отмена", НСтр("ru = 'Отмена'"));
		
		ПоказатьВопрос(ОписаниеОповещения, РезультатПодтверждения.ТекстПредупрежденияОПовторномПоиске, Кнопки);
		Возврат;
		
	КонецЕсли;
	
	Ошибки = РезультатПодтверждения.ОшибкиВыбораСтатуса;
	Если ТипЗнч(Ошибки) = Тип("Массив") И Ошибки.Количество() > 0 Тогда
		Элементы.РазвернутьПанель.Видимость = Ложь;
		Элементы.ГруппаДубли.Видимость = Истина;
		Элементы.СвернутьПанель.Видимость = Истина;
		
		ОчиститьСообщения();
		Для Каждого Ошибка Из Ошибки Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка.ТекстОшибки, , Ошибка.Поле);
		КонецЦикла;
	Иначе
		ЗавершитьПодтверждениеДублей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьОтчетОСравнении();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииЧтенииНаСервере(ИдентификаторДублей, ИдентификаторыГрупп)
	
	Дубли.Очистить();
	ДублиСПовторамиВГруппах.Очистить();
	
	ДублиЗаполнение = Обработки.ДублиНСИ.ДанныеЗаполненияФормыСравненияДублей(
		ИдентификаторыГрупп, ИдентификаторДублей);
	
	КоллекцияДублей = Новый Массив;
	ИндексыОригиналов = Новый Массив;
	Для Каждого СтрокаЗаполнение Из ДублиЗаполнение Цикл
		КоллекцияДублей.Добавить(СтрокаЗаполнение.Дубль);
		ЗаполнитьЗначенияСвойств(ДублиСПовторамиВГруппах.Добавить(), СтрокаЗаполнение);
		
		Если Дубли.НайтиСтроки(Новый Структура("Дубль", СтрокаЗаполнение.Дубль)).Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(Дубли.Добавить(), СтрокаЗаполнение);
		КонецЕсли;
		
		Если СтрокаЗаполнение.Статус = ПоискИЗаменаДублейНСИКлиентСервер.СтатусОригинал() Тогда
			ИндексыОригиналов.Добавить(ДублиЗаполнение.Индекс(СтрокаЗаполнение));
		КонецЕсли;
	КонецЦикла;
	
	Источники = ДублиЗаполнение.Скопировать(, "Источник");
	Источники.Свернуть("Источник");
	НесколькоИсточников = (Источники.Количество() > 1);
	Элементы.КСравнениюДобавленыСвязанныеДубли.Видимость = НесколькоИсточников;
	
	Если ИндексыОригиналов.Количество() > 1 Тогда
		Элементы.ПодтвердитьДубли.Доступность = Ложь;
		
		ТекстСообщения = НСтр("ru = 'В группе существует несколько подтвержденных оригиналов. Необходимо дождаться окончания процедуры замены дублей'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ПометкиУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(КоллекцияДублей, "ПометкаУдаления");
	Для Каждого СтрокаДубль Из Дубли Цикл
		СтрокаДубль.ИндексКартинки = Число(ПометкиУдаления[СтрокаДубль.Дубль]) + 1;
	КонецЦикла;
	Для Каждого СтрокаДубль Из ДублиСПовторамиВГруппах Цикл
		СтрокаДубль.ИндексКартинки = Число(ПометкиУдаления[СтрокаДубль.Дубль]) + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусДляВыделенных(Статус)
	
	Для Каждого ИндексСтроки Из Элементы.Дубли.ВыделенныеСтроки Цикл
		Дубли[ИндексСтроки].Статус = Статус;
	КонецЦикла;
	
	ПриИзмененииНастроекОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПометки(Значение)
	
	ВыделенныеСтроки = Элементы.Дубли.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 1 Тогда
		Для Каждого СтрокаТаблицы Из Дубли Цикл
			СтрокаТаблицы.Пометка = Значение;
		КонецЦикла;
	Иначе
		Для Каждого ИндексСтроки Из ВыделенныеСтроки Цикл
			Дубли[ИндексСтроки].Пометка = Значение;
		КонецЦикла;
	КонецЕсли;
	
	ПриИзмененииНастроекОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСтатусаВОтчете(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбластьОтчета = ОтчетОСравнении.Область(ДополнительныеПараметры.СтрокаНомер, ДополнительныеПараметры.КолонкаНомер);
		ОбластьОтчета.Значение = Результат.Значение;
		
		Дубль = Дубли.НайтиСтроки(Новый Структура("Дубль", ДополнительныеПараметры.Дубль))[0];
		Дубль.Статус = Результат.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатПодтвержденияДублей()
	
	Результат = Обработки.ДублиНСИ.ПодтвердитьДубли(Дубли, ИдентификаторДублей);
	
	ТаблицаОшибок = Результат.ОшибкиВыбораСтатуса;
	Если ТипЗнч(ТаблицаОшибок) = Тип("ТаблицаЗначений") Тогда
		Ошибки = Новый Массив;
		Для Каждого СтрокаОшибки Из ТаблицаОшибок Цикл
			СтруктураОшибки = Новый Структура("ТекстОшибки,Поле", СтрокаОшибки.ТекстОшибки, СтрокаОшибки.Поле);
			Ошибки.Добавить(СтруктураОшибки);
		КонецЦикла;
		Результат.ОшибкиВыбораСтатуса = Ошибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеПодтвержденияЗаменыДублей(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Если КодВозврата = "Продолжить" Тогда
		ОбработатьПодтверждениеДублейНаСервере();
		ЗавершитьПодтверждениеДублей();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодтверждениеДублейНаСервере()
	Обработки.ДублиНСИ.ПодтвердитьДубли(Дубли, ИдентификаторДублей, Ложь)
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодтверждениеДублей()
	
	Оповестить("ОбновитьРабочееМестоУдалениеДублейНСИ", ИдентификаторДублей);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетОСравнении()
	
	ДлительнаяОперация = ПодготовитьДлительнуюОперациюОтчета();
	
	Если ДлительнаяОперация <> Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеФормированияОтчета", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для построения отчета о сравнении необходимо выбрать не меньше двух дублей'"),
				,
				"Дубли[0].Пометка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДлительнуюОперациюОтчета()
	
	ОтмеченныеДубли = Дубли.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	Если ОтмеченныеДубли.Количество() > 1 Тогда
		ПередФормированиемОтчетаНаСервере();
		ДлительнаяОперация = НачатьФормированиеОтчетаНаСервере();
	Иначе
		ДлительнаяОперация = Неопределено;
	КонецЕсли;
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервере
Функция НачатьФормированиеОтчетаНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование отчета о сравнении дублей НСИ'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ДублиНСИ.ОтчетОСравнении",
		ИдентификаторДублей,
		Дубли.Выгрузить(),
		ВариантСравненияДублей);
		
КонецФункции

&НаКлиенте
Процедура ПослеФормированияОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	ОтчетОСравнении = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	ОтчетСформирован = Истина;
	ПоискИЗаменаДублейНСИКлиентСервер.УстановитьСостояниеПоляОтчета(Элементы.ОтчетОСравнении, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПередФормированиемОтчетаНаСервере()
	ПоискИЗаменаДублейНСИКлиентСервер.УстановитьСостояниеПоляОтчета(Элементы.ОтчетОСравнении, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастроекОтчета()
	
	Если ОтчетСформирован Тогда
		ПоискИЗаменаДублейНСИКлиентСервер.УстановитьСостояниеПоляОтчета(Элементы.ОтчетОСравнении, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
